Autodesk.Revit.DB.CurveElement.SetSketchPlaneAndCurve_DontCall(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Curve)
Sets a new curve and its plane.
Remarks:
Unlike setting either just the sketch plane or just the curve,
this method reestablishes the relationships between those two,
as well as it resets their relationship to other elements.
plane:
New sketch plane.
curve:
New curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CurveElement.GetAreaBasedLoadBoundaryLineData
Gets the area based load boundary line data from this curve, if applicable.
Remarks:
Will return null if curve element isn't an area based load boundary line.
Returns:
The area based load boundary line data, if this is an area based load boundary,
or null otherwise.
Since:
2023

Autodesk.Revit.DB.CurveElement.CreateAreaBasedLoadBoundaryLines(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Creates area based load boundary lines.
document:
The document in which to create the area based load boundary lines.
curves:
The curves.
levelId:
The id of level.
Returns:
The newly created area based load boundary lines.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input curves contains a null pointer or a curve that is not bounded.
-or-
The input curves contains at least one curve which is degenerate (its length is too close to zero).
-or-
The ElementId levelId is not a Level.
-or-
The input curves contains a curve doesn't lie in the plane of the level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.CurveElement.CreateAreaBasedLoadBoundaryLine(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId)
Creates an area based load boundary line.
document:
The document in which to create the area based load boundary line.
curve:
The curve.
levelId:
The id of level.
Returns:
The newly created area based load boundary line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input curve is not bound.
-or-
The curve is degenerate (its length is too close to zero).
-or-
The ElementId levelId is not a Level.
-or-
The curve doesn't lie in the plane of the level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.CurveElement.SetTangentLock(System.Int32,Autodesk.Revit.DB.ElementId,System.Boolean)
Sets a new status for an existing tangent join with another curve element at the given end-point.
Remarks:
The input status indicates whether the tangent join is to be locked or unlocked.
Note that the status can be set only if this and the other curve element are currently
joined and tangent at the given point.
Locking a tangent join between elements of a family will make the family parametric.
A parametric family needs to utilize a geometry solver in order to determine final
shapes of its instances. Using the solver in families which contain large sketches
may cause regenerations of such families to become significantly slower.
To determine whether a particular family falls into such a category, programmers
can query Autodesk.Revit.DB.Family.IsParametric property
and Autodesk::Revit::DB::Family::DoesContainLargeSketches()
method of the Autodesk.Revit.DB.Family class.
end:
Index of one of the curve's ends. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
state:
Requested new state of the lock; True to lock it, False to unlock it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
-or-
This element has no tangent join with the input element at the given end-point.
-or-
The element other does not exist in the document containing this CurveElement
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This curve element does not support tangent joins with other elements.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This CurveElement is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this CurveElement is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This CurveElement is a member of a group or sketch, and the document
is not currently editing the group or sketch.
-or-
other is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing other is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
other is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2017

Autodesk.Revit.DB.CurveElement.GetTangentLock(System.Int32,Autodesk.Revit.DB.ElementId)
Returns the state of a tangent join between this and another curve element at the given end-point.
Remarks:
The return value indicates whether there is such tangent join and if it is currently locked.
A negative value indicates that there either is no tangent join with the other element
at the given end-point, or the join between those two curve element is not currently locked.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if this curve element has a tangent joint with the other input element and the join is curently locked; returns False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
-or-
This element has no tangent join with the input element at the given end-point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.CurveElement.HasTangentJoin(System.Int32,Autodesk.Revit.DB.ElementId)
Tests whether this curve element and the input curve element have common tangent join at the given end-point.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if the two curve elements have a tangent join at the given end-point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.CurveElement.IsAdjoinedCurveElement(System.Int32,Autodesk.Revit.DB.ElementId)
This method tests whether this and the given curve elements are joined at the given end.
Remarks:
The input end is relative to this curve element.
The other curve element can be joined at any of its end-points.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if the input curve element joins This curve element at the given end-point; returns False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017